grevaillot/svd_tools/headers/STM32H7x5_CM4/dmamux1.h
#define DMAMUX1_C1CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C1CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c1cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c2cr C2CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C2CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C2CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c2cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C2CR_NBREQ_SHIFT		19
#define DMAMUX1_C2CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c2cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C2CR_SPOL_SHIFT		17
#define DMAMUX1_C2CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c2cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C2CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C2CR_SE		(1 << 16)
/** DMAMUX1_C2CR_EGE Event generation enable/disable **/
#define DMAMUX1_C2CR_EGE		(1 << 9)
/** DMAMUX1_C2CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C2CR_SOIE		(1 << 8)

#define DMAMUX1_C2CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C2CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c2cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c3cr C3CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C3CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C3CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c3cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C3CR_NBREQ_SHIFT		19
#define DMAMUX1_C3CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c3cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C3CR_SPOL_SHIFT		17
#define DMAMUX1_C3CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c3cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C3CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C3CR_SE		(1 << 16)
/** DMAMUX1_C3CR_EGE Event generation enable/disable **/
#define DMAMUX1_C3CR_EGE		(1 << 9)
/** DMAMUX1_C3CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C3CR_SOIE		(1 << 8)

#define DMAMUX1_C3CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C3CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c3cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c4cr C4CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C4CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C4CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c4cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C4CR_NBREQ_SHIFT		19
#define DMAMUX1_C4CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c4cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C4CR_SPOL_SHIFT		17
#define DMAMUX1_C4CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c4cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C4CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C4CR_SE		(1 << 16)
/** DMAMUX1_C4CR_EGE Event generation enable/disable **/
#define DMAMUX1_C4CR_EGE		(1 << 9)
/** DMAMUX1_C4CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C4CR_SOIE		(1 << 8)

#define DMAMUX1_C4CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C4CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c4cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c5cr C5CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C5CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C5CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c5cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C5CR_NBREQ_SHIFT		19
#define DMAMUX1_C5CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c5cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C5CR_SPOL_SHIFT		17
#define DMAMUX1_C5CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c5cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C5CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C5CR_SE		(1 << 16)
/** DMAMUX1_C5CR_EGE Event generation enable/disable **/
#define DMAMUX1_C5CR_EGE		(1 << 9)
/** DMAMUX1_C5CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C5CR_SOIE		(1 << 8)

#define DMAMUX1_C5CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C5CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c5cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c6cr C6CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C6CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C6CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c6cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C6CR_NBREQ_SHIFT		19
#define DMAMUX1_C6CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c6cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C6CR_SPOL_SHIFT		17
#define DMAMUX1_C6CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c6cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C6CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C6CR_SE		(1 << 16)
/** DMAMUX1_C6CR_EGE Event generation enable/disable **/
#define DMAMUX1_C6CR_EGE		(1 << 9)
/** DMAMUX1_C6CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C6CR_SOIE		(1 << 8)

