grevaillot/svd_tools/headers/STM32H7x5_CM4/dmamux1.h
#define DMAMUX1_C6CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C6CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c6cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c7cr C7CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C7CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C7CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c7cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C7CR_NBREQ_SHIFT		19
#define DMAMUX1_C7CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c7cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C7CR_SPOL_SHIFT		17
#define DMAMUX1_C7CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c7cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C7CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C7CR_SE		(1 << 16)
/** DMAMUX1_C7CR_EGE Event generation enable/disable **/
#define DMAMUX1_C7CR_EGE		(1 << 9)
/** DMAMUX1_C7CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C7CR_SOIE		(1 << 8)

#define DMAMUX1_C7CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C7CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c7cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c8cr C8CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C8CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C8CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c8cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C8CR_NBREQ_SHIFT		19
#define DMAMUX1_C8CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c8cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C8CR_SPOL_SHIFT		17
#define DMAMUX1_C8CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c8cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C8CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C8CR_SE		(1 << 16)
/** DMAMUX1_C8CR_EGE Event generation enable/disable **/
#define DMAMUX1_C8CR_EGE		(1 << 9)
/** DMAMUX1_C8CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C8CR_SOIE		(1 << 8)

#define DMAMUX1_C8CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C8CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c8cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c9cr C9CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C9CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C9CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c9cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C9CR_NBREQ_SHIFT		19
#define DMAMUX1_C9CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c9cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C9CR_SPOL_SHIFT		17
#define DMAMUX1_C9CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c9cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C9CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C9CR_SE		(1 << 16)
/** DMAMUX1_C9CR_EGE Event generation enable/disable **/
#define DMAMUX1_C9CR_EGE		(1 << 9)
/** DMAMUX1_C9CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C9CR_SOIE		(1 << 8)

#define DMAMUX1_C9CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C9CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c9cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c10cr C10CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C10CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C10CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c10cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C10CR_NBREQ_SHIFT		19
#define DMAMUX1_C10CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c10cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C10CR_SPOL_SHIFT		17
#define DMAMUX1_C10CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c10cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C10CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C10CR_SE		(1 << 16)
/** DMAMUX1_C10CR_EGE Event generation enable/disable **/
#define DMAMUX1_C10CR_EGE		(1 << 9)
/** DMAMUX1_C10CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C10CR_SOIE		(1 << 8)

#define DMAMUX1_C10CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C10CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c10cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c11cr C11CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C11CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C11CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c11cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C11CR_NBREQ_SHIFT		19
#define DMAMUX1_C11CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c11cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C11CR_SPOL_SHIFT		17
#define DMAMUX1_C11CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c11cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C11CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C11CR_SE		(1 << 16)
/** DMAMUX1_C11CR_EGE Event generation enable/disable **/
#define DMAMUX1_C11CR_EGE		(1 << 9)
/** DMAMUX1_C11CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C11CR_SOIE		(1 << 8)

#define DMAMUX1_C11CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C11CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c11cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c12cr C12CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C12CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C12CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c12cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


