grevaillot/svd_tools/headers/STM32H7x5_CM4/dmamux1.h
#define DMAMUX1_C12CR_NBREQ_SHIFT		19
#define DMAMUX1_C12CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c12cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C12CR_SPOL_SHIFT		17
#define DMAMUX1_C12CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c12cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C12CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C12CR_SE		(1 << 16)
/** DMAMUX1_C12CR_EGE Event generation enable/disable **/
#define DMAMUX1_C12CR_EGE		(1 << 9)
/** DMAMUX1_C12CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C12CR_SOIE		(1 << 8)

#define DMAMUX1_C12CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C12CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c12cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c13cr C13CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C13CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C13CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c13cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C13CR_NBREQ_SHIFT		19
#define DMAMUX1_C13CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c13cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C13CR_SPOL_SHIFT		17
#define DMAMUX1_C13CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c13cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C13CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C13CR_SE		(1 << 16)
/** DMAMUX1_C13CR_EGE Event generation enable/disable **/
#define DMAMUX1_C13CR_EGE		(1 << 9)
/** DMAMUX1_C13CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C13CR_SOIE		(1 << 8)

#define DMAMUX1_C13CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C13CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c13cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c14cr C14CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C14CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C14CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c14cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C14CR_NBREQ_SHIFT		19
#define DMAMUX1_C14CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c14cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C14CR_SPOL_SHIFT		17
#define DMAMUX1_C14CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c14cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C14CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C14CR_SE		(1 << 16)
/** DMAMUX1_C14CR_EGE Event generation enable/disable **/
#define DMAMUX1_C14CR_EGE		(1 << 9)
/** DMAMUX1_C14CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C14CR_SOIE		(1 << 8)

#define DMAMUX1_C14CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C14CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c14cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_c15cr C15CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_C15CR_SYNC_ID_SHIFT		24
#define DMAMUX1_C15CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_c15cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_C15CR_NBREQ_SHIFT		19
#define DMAMUX1_C15CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_c15cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_C15CR_SPOL_SHIFT		17
#define DMAMUX1_C15CR_SPOL_MASK		0x03
/** @defgroup dmamux1_c15cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_C15CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_C15CR_SE		(1 << 16)
/** DMAMUX1_C15CR_EGE Event generation enable/disable **/
#define DMAMUX1_C15CR_EGE		(1 << 9)
/** DMAMUX1_C15CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_C15CR_SOIE		(1 << 8)

#define DMAMUX1_C15CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_C15CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_c15cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_csr CSR DMAMUX request line multiplexer interrupt channel status register
@{*/


#define DMAMUX1_CSR_SOF_SHIFT		0
#define DMAMUX1_CSR_SOF_MASK		0xffff
/** @defgroup dmamux1_csr_sof SOF Synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_cfr CFR DMAMUX request line multiplexer interrupt clear flag register
@{*/


#define DMAMUX1_CFR_CSOF_SHIFT		0
#define DMAMUX1_CFR_CSOF_MASK		0xffff
/** @defgroup dmamux1_cfr_csof CSOF Clear synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg0cr RG0CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG0CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG0CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg0cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG0CR_GPOL_SHIFT		17
#define DMAMUX1_RG0CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg0cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG0CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG0CR_GE		(1 << 16)
/** DMAMUX1_RG0CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG0CR_OIE		(1 << 8)

#define DMAMUX1_RG0CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG0CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg0cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

