grevaillot/svd_tools/headers/STM32H7x5_CM4/dmamux1.h
/** @defgroup dmamux1_rg1cr RG1CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG1CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG1CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg1cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG1CR_GPOL_SHIFT		17
#define DMAMUX1_RG1CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg1cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG1CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG1CR_GE		(1 << 16)
/** DMAMUX1_RG1CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG1CR_OIE		(1 << 8)

#define DMAMUX1_RG1CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG1CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg1cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg2cr RG2CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG2CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG2CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg2cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG2CR_GPOL_SHIFT		17
#define DMAMUX1_RG2CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg2cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG2CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG2CR_GE		(1 << 16)
/** DMAMUX1_RG2CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG2CR_OIE		(1 << 8)

#define DMAMUX1_RG2CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG2CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg2cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg3cr RG3CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG3CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG3CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg3cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG3CR_GPOL_SHIFT		17
#define DMAMUX1_RG3CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg3cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG3CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG3CR_GE		(1 << 16)
/** DMAMUX1_RG3CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG3CR_OIE		(1 << 8)

#define DMAMUX1_RG3CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG3CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg3cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg4cr RG4CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG4CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG4CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg4cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG4CR_GPOL_SHIFT		17
#define DMAMUX1_RG4CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg4cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG4CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG4CR_GE		(1 << 16)
/** DMAMUX1_RG4CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG4CR_OIE		(1 << 8)

#define DMAMUX1_RG4CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG4CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg4cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg5cr RG5CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG5CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG5CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg5cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG5CR_GPOL_SHIFT		17
#define DMAMUX1_RG5CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg5cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG5CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG5CR_GE		(1 << 16)
/** DMAMUX1_RG5CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG5CR_OIE		(1 << 8)

#define DMAMUX1_RG5CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG5CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg5cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg6cr RG6CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG6CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG6CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg6cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


