grevaillot/svd_tools/headers/STM32H7x5_CM4/dmamux1.h
#define DMAMUX1_RG6CR_GPOL_SHIFT		17
#define DMAMUX1_RG6CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg6cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG6CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG6CR_GE		(1 << 16)
/** DMAMUX1_RG6CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG6CR_OIE		(1 << 8)

#define DMAMUX1_RG6CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG6CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg6cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rg7cr RG7CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_RG7CR_GNBREQ_SHIFT		19
#define DMAMUX1_RG7CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_rg7cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_RG7CR_GPOL_SHIFT		17
#define DMAMUX1_RG7CR_GPOL_MASK		0x03
/** @defgroup dmamux1_rg7cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_RG7CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_RG7CR_GE		(1 << 16)
/** DMAMUX1_RG7CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_RG7CR_OIE		(1 << 8)

#define DMAMUX1_RG7CR_SIG_ID_SHIFT		0
#define DMAMUX1_RG7CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_rg7cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rgsr RGSR DMAMux - DMA request generator status register
@{*/


#define DMAMUX1_RGSR_OF_SHIFT		0
#define DMAMUX1_RGSR_OF_MASK		0xff
/** @defgroup dmamux1_rgsr_of OF Trigger event overrun flag The flag is set when a trigger event occurs on DMA request generator channel x, while the DMA request generator counter value is lower than GNBREQ. The flag is cleared by writing 1 to the corresponding COFx bit in DMAMUX_RGCFR register.
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_rgcfr RGCFR DMAMux - DMA request generator clear flag register
@{*/


#define DMAMUX1_RGCFR_COF_SHIFT		0
#define DMAMUX1_RGCFR_COF_MASK		0xff
/** @defgroup dmamux1_rgcfr_cof COF Clear trigger event overrun flag Upon setting, this bit clears the corresponding overrun flag OFx in the DMAMUX_RGCSR register.
@{*/
/**@}*/


/**@}*/
